Ran Plan for 2 projects:

1. project: `ec2` dir: `services/ec2` workspace: `default`
1. project: `iam` dir: `services/iam` workspace: `default`

### 1. project: `ec2` dir: `services/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2021/05/05 06:26:00 Reading Terragrunt config file at /atlantis-data/repos/emraanali11/live-terraform/5/default/services/ec2/terragrunt.hcl
[terragrunt] [/atlantis-data/repos/emraanali11/live-terraform/5/default/services/ec2] 2021/05/05 06:26:00 Running command: terraform0.12.19 --version
[terragrunt] 2021/05/05 06:26:01 Initializing remote state for the s3 backend
[terragrunt] 2021/05/05 06:26:02 Running command: terraform0.12.19 init -backend-config=dynamodb_table=terraform-lock-imran -backend-config=encrypt=true -backend-config=key=./terraform.tfstate -backend-config=region=us-west-2 -backend-config=bucket=terraform-k8-remote-state-imran21 -input=false -lock-timeout=20m -input=false -no-color
Initializing modules...
Downloading git::https://github.com/emraanali11/terraform_modules.git for ec2...
- ec2 in .terraform/modules/ec2/ec2
Downloading git::https://github.com/emraanali11/terraform_modules.git for ec21...
- ec21 in .terraform/modules/ec21/ec2

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 3.37.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 3.37"


Warning: registry.terraform.io: This version of Terraform has an outdated GPG key and is unable to verify new provider releases. Please upgrade Terraform to at least 0.12.31 to receive new provider updates. For details see: https://discuss.hashicorp.com/t/hcsec-2021-12-codecov-security-event-and-hashicorp-gpg-key-exposure/23512


Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

[terragrunt] 2021/05/05 06:26:27 Reading Terragrunt config file at /atlantis-data/repos/emraanali11/live-terraform/5/default/services/ec2/terragrunt.hcl
[terragrunt] [/atlantis-data/repos/emraanali11/live-terraform/5/default/services/ec2] 2021/05/05 06:26:27 Running command: terraform0.12.19 --version
[terragrunt] 2021/05/05 06:26:35 Running command: terraform0.12.19 plan -lock-timeout=20m -no-color -out=/atlantis-data/repos/emraanali11/live-terraform/5/default/services/ec2/ec2-default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_instance.instances[0] will be created
  + resource "aws_instance" "instances" {
      + ami                          = "var.ami_id"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "var.instance_type"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "var.subnet"
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = [
          + "var.vpc_security_group_ids",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec21.aws_instance.instances[0] will be created
  + resource "aws_instance" "instances" {
      + ami                          = "var.ami_id"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "var.instance_type"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "var.subnet"
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = [
          + "var.vpc_security_group_ids",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 8, in provider "aws":
   8:   region = "${var.region}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


------------------------------------------------------------------------

This plan was saved to: /atlantis-data/repos/emraanali11/live-terraform/5/default/services/ec2/ec2-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/emraanali11/live-terraform/5/default/services/ec2/ec2-default.tfplan"


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.analytics.saas.appd-test.com/lock?id=emraanali11%252Flive-terraform%252Fservices%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p ec2`
</details>

---
### 2. project: `iam` dir: `services/iam` workspace: `default`
<details><summary>Show Output</summary>

```diff
[terragrunt] 2021/05/05 06:27:01 Reading Terragrunt config file at /atlantis-data/repos/emraanali11/live-terraform/5/default/services/iam/terragrunt.hcl
[terragrunt] [/atlantis-data/repos/emraanali11/live-terraform/5/default/services/iam] 2021/05/05 06:27:01 Running command: terraform0.12.19 --version
[terragrunt] 2021/05/05 06:27:02 Initializing remote state for the s3 backend
[terragrunt] 2021/05/05 06:27:02 Running command: terraform0.12.19 init -backend-config=key=./terraform.tfstate -backend-config=region=us-west-2 -backend-config=bucket=terraform-k8-remote-state-imran21 -backend-config=dynamodb_table=terraform-lock-imran -backend-config=encrypt=true -input=false -lock-timeout=20m -input=false -no-color
Initializing modules...
Downloading git::https://github.com/emraanali11/terraform_modules.git for iam...
- iam in .terraform/modules/iam/iam

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 3.37.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 3.37"


Warning: registry.terraform.io: This version of Terraform has an outdated GPG key and is unable to verify new provider releases. Please upgrade Terraform to at least 0.12.31 to receive new provider updates. For details see: https://discuss.hashicorp.com/t/hcsec-2021-12-codecov-security-event-and-hashicorp-gpg-key-exposure/23512


Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

[terragrunt] 2021/05/05 06:27:27 Reading Terragrunt config file at /atlantis-data/repos/emraanali11/live-terraform/5/default/services/iam/terragrunt.hcl
[terragrunt] [/atlantis-data/repos/emraanali11/live-terraform/5/default/services/iam] 2021/05/05 06:27:27 Running command: terraform0.12.19 --version
[terragrunt] 2021/05/05 06:27:34 Running command: terraform0.12.19 plan -lock-timeout=20m -no-color -out=/atlantis-data/repos/emraanali11/live-terraform/5/default/services/iam/iam-default.tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.aws_iam_role.eks-cluster-iam-role will be created
  + resource "aws_iam_role" "eks-cluster-iam-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-eks-test-cluster"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role_policy_attachment.eks-cluster-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-cluster-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "terraform-eks-test-cluster"
    }

  # module.iam.aws_iam_role_policy_attachment.eks-cluster-AmazonEKSServicePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-cluster-AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "terraform-eks-test-cluster"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 8, in provider "aws":
   8:   region = "${var.region}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


------------------------------------------------------------------------

This plan was saved to: /atlantis-data/repos/emraanali11/live-terraform/5/default/services/iam/iam-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/emraanali11/live-terraform/5/default/services/iam/iam-default.tfplan"


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.analytics.saas.appd-test.com/lock?id=emraanali11%252Flive-terraform%252Fservices%252Fiam%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
